templates/rightStripBendTemplate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        nFaces          6260;
        startFace       5963;
    }
    fixedWalls
    {
        type            wall;
        nFaces          374;
        startFace       12223;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       12597;
    }
    outlet
    {
        type            patch;
        nFaces          35;
        startFace       12617;
    }
)

// ************************************************************************* //
